Revit 2027 API
DockablePanes.BuiltInDockablePanes.PropertiesPalette Property
 The properties palette pane.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static DockablePaneId PropertiesPalette { get; }
Public Shared ReadOnly Property PropertiesPalette As DockablePaneId
	Get
public:
static property DockablePaneId^ PropertiesPalette {
	DockablePaneId^ get ();
}
static member PropertiesPalette : DockablePaneId with get
Property Value
DockablePaneId
See Also
Reference
DockablePanes.BuiltInDockablePanes Class
Autodesk.Revit.UI Namespace